In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1.Create a Datatime index containing all the weekdays days of year 2019 and assign a random number 
# to each of them in a dataframe. 

s = pd.date_range('2019-01-01', '2019-12-31', freq='B')
print(s)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-07', '2019-01-08', '2019-01-09', '2019-01-10',
               '2019-01-11', '2019-01-14',
               ...
               '2019-12-18', '2019-12-19', '2019-12-20', '2019-12-23',
               '2019-12-24', '2019-12-25', '2019-12-26', '2019-12-27',
               '2019-12-30', '2019-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')

In [3]:
# 2.Given Pandas series , height = [23,42,55] and weight = [71,32,48] . 
# Create a dataframe with height and weight as column names. 

height = [23,42,55]
weight = [71,32,48]
# weight = pd.Series(weight)
# height = pd.Series(height)
frame = {"height":height,"weight":weight}
df = pd.DataFrame(frame)
df

   height  weight
0      23      71
1      42      32
2      55      48

In [4]:
# 3.How to get the items of series A not present in series B .From ser1 remove items present in ser2.

ser1=pd.Series([2,3,4,5])
ser2=pd.Series([5,6,7,8])
ser1[~ser1.isin(ser2)]

0    2
1    3
2    4
dtype: int64

In [5]:
# Questions on Titanic Dataset :-

# 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

titanic_df = pd.read_csv("C:\\Users\\user\\Desktop\\Personal\\Supervised-Learning\\SupervisedLearning-EndToEndDataScience\\Datasets\\titanic.csv")
# titanic_df.head()
age = titanic_df["Age"]
print("Age min : ",age.min(),"\nAge 25th percentile : ",age.quantile(.25),"\nAge median : ",age.median(),"\nAge 25th percentile : ",age.quantile(.75),"\nAge max : ",age.max())

Age min :  0.42
Age 25th percentile :  20.125
Age median :  28.0
Age 25th percentile :  38.0
Age max :  80.0

In [6]:
# 5. How to get frequency counts of unique items of a series? 
# Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

SibSp = titanic_df["SibSp"]
# print(SibSp.unique())
SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [7]:
# 6. Keep only top 2 most frequent values as it is and replace everything else 
# as ‘Other’ in ‘Embarked’ column of titanic dataset

# to get value counts
# titanic_df["Embarked"].value_counts()

# first 2 frequent values
# titanic_df["Embarked"].value_counts()[:2]

X = titanic_df["Embarked"].value_counts()[:2].index

titanic_df.loc[~titanic_df.Embarked.isin(X), "Embarked"] = "Other"

titanic_df["Embarked"].value_counts()

S        644
C        168
Other     79
Name: Embarked, dtype: int64

In [8]:
# 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin

# equal width bins
print(pd.cut(titanic_df["Fare"],5).value_counts())

#equal sized bins
print(pd.qcut(titanic_df["Fare"],5).value_counts())

(-0.512, 102.466]     838
(102.466, 204.932]     33
(204.932, 307.398]     17
(409.863, 512.329]      3
(307.398, 409.863]      0
Name: Fare, dtype: int64
(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: Fare, dtype: int64

In [9]:
#8. Count the number of missing values in each column?

titanic_df.isnull().sum()

# count of missing numbers for each row
# for i in range(len(titanic_df.index)) :
#     print("Nan in row ", i , " : " ,  titanic_df.iloc[i].isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [10]:
# 9. Get the row number of the 5th largest value in the Age column of titanic dataset?

# to get 5 larges values in column Age
# print(titanic_df.Age.nlargest(5))

#to get 5th largest value in column Age
# print(titanic_df.Age.nlargest(5).iloc[-1])

#to get row number of 5th largest value in column Age
print(titanic_df.Age.nlargest(5).index[-1])

116

In [11]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# 10. Normalize all columns in a dataframe?

# normalized_df=(df-df.min())/(df.max()-df.min())

from sklearn.preprocessing import LabelEncoder

titanic_df = pd.read_csv("C:\\Users\\user\\Desktop\\Personal\\Supervised-Learning\\SupervisedLearning-EndToEndDataScience\\Datasets\\titanic.csv")

print("before :\n ",titanic_df[["Name","Sex"]].head())
cat_features=[x for x in titanic_df.columns if titanic_df[x].dtype=="object"]

le=LabelEncoder()

for col in cat_features:
    if col in titanic_df.columns:
        i = titanic_df.columns.get_loc(col)
        titanic_df.iloc[:,i] = titanic_df.apply(lambda i:le.fit_transform(i.astype(str)), axis=0, result_type='expand')
    
print("after :\n ",titanic_df[["Name","Sex"]].head())
# cat_cols

normalized_df=(titanic_df-titanic_df.min())/(titanic_df.max()-titanic_df.min())

normalized_df.head()

before :
                                                  Name     Sex
0                            Braund, Mr. Owen Harris    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male
after :
     Name  Sex
0   108    1
1   190    0
2   353    0
3   272    0
4    15    1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0.000000,0.0,1.0,0.121348,1.0,0.271174,0.125,0.0,0.769118,0.014151,1.00000,0.666667
1,0.001124,1.0,0.0,0.213483,0.0,0.472229,0.125,0.0,0.876471,0.139136,0.55102,0.000000
2,0.002247,1.0,1.0,0.396629,0.0,0.321438,0.000,0.0,0.983824,0.015469,1.00000,0.666667
3,0.003371,1.0,0.0,0.305618,0.0,0.434531,0.125,0.0,0.072059,0.103644,0.37415,0.666667
4,0.004494,0.0,1.0,0.016854,1.0,0.434531,0.000,0.0,0.694118,0.015713,1.00000,0.666667

In [13]:
# 11. Get the indices of items of ser2 in ser1 as a list.

ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

ser1[ser1.isin(ser2)].index

Int64Index([0, 4, 5, 8], dtype='int64')

In [14]:
# 12. How to convert a series of date-strings to a timeseries?

ser = pd.Series(['1 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
ser = pd.to_datetime(ser)
ser

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [15]:
ser[0].week

53

In [16]:
print("Day of month : \n",ser.dt.day)
print("Day of week : \n",ser.dt.dayofweek)
print("Day of Year: \n",ser.dt.dayofyear)
print("Week of Year: \n",ser.dt.week)

Day of month :
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
Day of week :
 0    4
1    2
2    5
3    3
4    0
5    5
dtype: int64
Day of Year:
 0      1
1     33
2     63
3     94
4    125
5    157
dtype: int64
Week of Year:
 0    53
1     5
2     9
3    14
4    19
5    23
dtype: int64

In [17]:
# 14. Compute the euclidean distance between series (points) p and q,
# without using a packaged formula.

## Euclidean distance for (xa, ya, za) and (xb, yb, zb) is 
#   dist = sqrt((xa-xb)^2 + (ya-yb)^2 + (za-zb)^2)

p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

print("\nEuclidean distance between p and q series:")
print(np.linalg.norm(p-q))

Euclidean distance between p and q series:
18.16590212458495

In [18]:
# 15. How to create a TimeSeries starting ‘2000-01-01’
# and 10 weekends (saturdays/sundays)

cbd = pd.tseries.offsets.CustomBusinessDay(weekmask = 'Sat Sun') 
s = pd.date_range('2000-01-01',periods=20,freq=cbd)
print(s)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-08', '2000-01-09',
               '2000-01-15', '2000-01-16', '2000-01-22', '2000-01-23',
               '2000-01-29', '2000-01-30', '2000-02-05', '2000-02-06',
               '2000-02-12', '2000-02-13', '2000-02-19', '2000-02-20',
               '2000-02-26', '2000-02-27', '2000-03-04', '2000-03-05'],
              dtype='datetime64[ns]', freq='C')

In [19]:
# 16. Import every 50th row of BostonHousing dataset as a dataframe.
boston_housing_df = pd.read_csv("C:\\Users\\user\\Desktop\\Personal\\Supervised-Learning\\SupervisedLearning-EndToEndDataScience\\Datasets\\boston_house_price.csv")
boston_housing_df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [20]:
boston_housing_df = boston_housing_df[::50]
boston_housing_df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9